<script setup>
import FaqBlock from '@/components/FaqBlock.vue'

const faqItems = [
  {
    question: 'Как рассчитать стоимость проекта ландшафтного дизайна?',
    answer: 'Для расчета стоимости проекта ландшафтного дизайна необходимо учесть площадь участка, сложность дизайна и выбор материалов. Также важно учитывать трудозатраты специалистов и дополнительные услуги, такие как освещение или системы полива.'
  },
  {
    question: 'Сколько времени нужно на создание ландшафтного проекта? ',
    answer: 'Время разработки ландшафтного проекта варьируется в зависимости от площади участка, сложности самого проекта, полноты необходимой документации и процесса согласования. Универсальных сроков не существует, так как они зависят от особенностей территории и поставленных задач. В среднем создание ландшафтного проекта занимает от 1 до 2 месяцев.'
  },
  {
    question: 'Какое количество правок можно вносить?',
    answer: 'На этапе эскизного проектирования допускаются до двух внесений правок, а на этапе разработки рабочей документации — одно внесение правок.'
  },
  {
    question: 'Как получить ожидаемый результат?',
    answer: 'Необходимо поделиться всеми своими идеями с автором проекта и полностью довериться профессионалам. В таком случае командная работа принесет наилучший результат.'
  }
]
</script>

<template>
  <FaqBlock :items="faqItems" />
</template>